{
    "data": "Gradient Descent Algorithm Gradient Descent Algorithm iteratively calculates the next point using gradient at the current position, scales it (by a learning rate) and subtracts obtained value from the current position (makes a step). It subtracts the value because we want to minimise the function (to maximise it would be adding). This process can be written as:p_{n+1} = p_n - η * ∇f(p_n) There’s an important parameter η which scales the gradient and thus controls the step size. In machine learning, it is called learning rate and have a strong influence on performance. The smaller learning rate the longer GD converges, or may reach maximum iteration before reaching the optimum point If learning rate is too big the algorithm may not converge to the optimal point (jump around) or even to diverge completely. In summary, Gradient Descent method’s steps are: 1-choose a starting point (initialisation), 2-calculate gradient at this point, 3-make a scaled step in the opposite direction to the gradient (objective: minimise), 4-repeat points 2 and 3 until one of the criteria is met: maximum number of iterations reached step size is smaller than the tolerance (due to scaling or a small gradient).",
    "goal": "**Extracted Core Principle:** The effect of learning rate (η) on the performance of the Gradient Descent Algorithm.\n\n**Query:**\nCreate a visualization to explain the relationship between the learning rate (η) and the convergence behavior of the Gradient Descent Algorithm. The goal is to illustrate how different values of the learning rate influence the distance of each step taken towards the optimal point, and how this affects speed and accuracy of convergence. The intended concept is the trade-off involved in selecting an appropriate learning rate, highlighting cause-effect relationships between the size of η and the algorithm's effectiveness. \n\nA flowchart or infographic should be used to demonstrate different scenarios: one for a small learning rate, one for an optimal learning rate, and one for a large learning rate, showcasing paths towards convergence or divergence. By clearly labeling each path with annotations explaining the outcomes (e.g., iterations taken, overshooting, or zigzagging behavior), the visualization will deepen learners' understanding of how parameter choice impacts algorithm performance and effectiveness.\n\n**Educational Objective:**\nThe learner will achieve a profound understanding of the importance of selecting an optimal learning rate in the Gradient Descent Algorithm, discern how it influences convergence speed, and recognize the potential pitfalls of suboptimal parameter settings. This knowledge will empower learners to make informed decisions when tuning algorithms in practical applications.",
    "code": "```python\nimport numpy as np\nimport matplotlib.pyplot as plt\n\n# Setup the figure and axes for the flowchart\nfig, ax = plt.subplots(figsize=(12, 8))\n\n# Define learning rates\nlearning_rates = {\n    'Small Learning Rate (η = 0.01)': {\n        'path': [0, 1, 1.5, 1.8, 2],\n        'color': 'blue',\n        'label': 'Converges slowly\\n(Accumulated Error: Low)'\n    },\n    'Optimal Learning Rate (η = 0.1)': {\n        'path': [0, 1, 2],\n        'color': 'green',\n        'label': 'Converges quickly\\n(Optimal Error: Balanced)'\n    },\n    'Large Learning Rate (η = 1.0)': {\n        'path': [0, 3, 5, 7],\n        'color': 'red',\n        'label': 'Overshooting\\n(Divergence)'\n    }\n}\n\n# Plot the paths for each learning rate\nfor i, (label, data) in enumerate(learning_rates.items()):\n    steps = np.array(data['path'])\n    ax.plot(steps, np.full(steps.shape, i), marker='o', color=data['color'], label=label)\n    for j, val in enumerate(steps):\n        ax.annotate(f\"Step {j + 1}\", (val, i), textcoords=\"offset points\", xytext=(0,5), ha='center')\n\n# Annotate outcomes\nfor i, (label, data) in enumerate(learning_rates.items()):\n    ax.text(2, i, data['label'], verticalalignment='center', horizontalalignment='left', fontsize=10,\n            bbox=dict(facecolor='white', alpha=0.85, edgecolor=data['color'], boxstyle='round,pad=0.5'))\n\n# Setting the axes and title\nax.set_yticks(range(len(learning_rates)))\nax.set_yticklabels(learning_rates.keys())\nax.set_xlim(-0.5, 8)\nax.set_xlabel('Steps Towards Convergence')\nax.set_title('Effect of Learning Rate (η) on Gradient Descent Convergence', fontsize=14)\nax.legend(loc='upper right', title='Learning Rates', title_fontsize='13')\n\n# Hide the x-axis\nax.xaxis.set_visible(False)\nplt.grid(False)\n```"
}