{
    "data": "Gradient Descent Algorithm Gradient Descent Algorithm iteratively calculates the next point using gradient at the current position, scales it (by a learning rate) and subtracts obtained value from the current position (makes a step). It subtracts the value because we want to minimise the function (to maximise it would be adding). This process can be written as:p_{n+1} = p_n - η * ∇f(p_n) There’s an important parameter η which scales the gradient and thus controls the step size. In machine learning, it is called learning rate and have a strong influence on performance. The smaller learning rate the longer GD converges, or may reach maximum iteration before reaching the optimum point If learning rate is too big the algorithm may not converge to the optimal point (jump around) or even to diverge completely. In summary, Gradient Descent method’s steps are: 1-choose a starting point (initialisation), 2-calculate gradient at this point, 3-make a scaled step in the opposite direction to the gradient (objective: minimise), 4-repeat points 2 and 3 until one of the criteria is met: maximum number of iterations reached step size is smaller than the tolerance (due to scaling or a small gradient).",
    "goal": "**Core Principle:** The iterative nature of the Gradient Descent Algorithm, particularly the importance of the learning rate (η) in controlling step size and convergence behavior.\n\n---\n\n**Query:**\n\nCreate a visualization to explain the iterative process of the Gradient Descent Algorithm, focusing on how the learning rate (η) influences step size, convergence, and the overall performance of the algorithm. The goal is to clarify the relationship between the current position \\(p_n\\), the calculated gradient \\(\\nabla f(p_n)\\), and the resultant position \\(p_{n+1}\\) after applying the learning rate. \n\nThis visualization should utilize a flowchart style that illustrates each step of the algorithm, from selecting the initial position to iteratively adjusting based on the gradient, while highlighting different outcomes based on varying learning rates (too small, optimal, and too large). \n\nBy demonstrating the consequences of different learning rates on convergence (either to the minimum or divergent behavior), the visual will enhance understanding of how these factors interconnect in the Gradient Descent process, enabling learners to appreciate the trade-offs that influence optimization. \n\n**Objective:** To facilitate a deep understanding of the iterative nature of the Gradient Descent Algorithm, emphasizing the critical role of the learning rate in the convergence process and its impact on algorithm performance.",
    "code": "```python\nimport numpy as np\nimport matplotlib.pyplot as plt\n\n# Create figure and axis\nfig, ax = plt.subplots(figsize=(12, 8))\n\n# Prepare gradient descent samples\nx = np.linspace(-4, 4, 100)\ny = (x**2)  # Define a simple quadratic function\ngradient = 2*x  # Gradient of the function\n\n# Initialize parameters for learning rates\nlearning_rates = {'Too Small (η = 0.01)': 0.01, \n                  'Optimal (η = 0.1)': 0.1, \n                  'Too Large (η = 1.0)': 1.0}\n\n# Initial position\np_n = 3.0  # Starting point\niterations = 5  # Number of iterations\npositions = {label: [p_n] for label in learning_rates.keys()}\n\nfor label, lr in learning_rates.items():\n    for _ in range(iterations):\n        gradient_at_p_n = 2 * positions[label][-1]  # Compute gradient\n        p_n_next = positions[label][-1] - lr * gradient_at_p_n  # Update position\n        positions[label].append(p_n_next)  # Store the new position\n\n# Plotting\nax.plot(x, y, label='f(x) = x²', color='blue', lw=2)\nax.axhline(0, color='black', lw=0.5, ls='--')\nax.axvline(0, color='black', lw=0.5, ls='--')\nax.set_title('Gradient Descent: Effect of Learning Rates on Convergence', fontsize=16)\nax.set_xlabel('Position (p)', fontsize=14)\nax.set_ylabel('Function Value (f)', fontsize=14)\nax.set_ylim(-2, 10)\nax.set_xlim(-4, 4)\nax.legend()\n\n# Plot the paths for each learning rate\ncolors = {'Too Small (η = 0.01)': 'orange', 'Optimal (η = 0.1)': 'green', 'Too Large (η = 1.0)': 'red'}\nfor label, path in positions.items():\n    ax.plot(path, [f(p) for p in path], marker='o', color=colors[label], label=label)\n\n# Labels\nfor label, path in positions.items():\n    for p in path:\n        ax.text(p, p**2 + 0.5, f'{p:.2f}', fontsize=10, ha='center')\n\nax.legend()\n```"
}